package extra;

/*
* Задание
* Создайте 2 класса, Animal и Cat.
* В классе Animal инициализируйте 3 поля различных модификаторов.
* В классе Cat используя рефлексию получите доступ к полям класса Animal и измените содержимое каждого из полей.
* */

public class Main {
    public static void main(String[] args) {
        System.out.println(new Animal());
        System.out.println(new Cat());
    }
}
